public_html/articles/emacs/cedet.html
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#unnumbered-1">Инсталляция</a></li>
<li><a href="#unnumbered-2">Компиляция в Emacs-e</a></li>
<li><a href="#unnumbered-3">Настройка</a></li>
</ul>
</div>
</div>
<p>
@category emacs
@sort emacs002
</p>

<heading id="outline-container-unnumbered-1" class="outline-2">
<h2 id="unnumbered-1">Инсталляция</h2>
<div class="outline-text-2" id="text-unnumbered-1">
<p>
Сегодня мы установим в наш emacs настоящий вертолет, который называтся
cedet. Пакет Cedet объединяет в своем составе несколько пакетов,
реализующих различную функциональность, но объединенных вокруг одной
задачи по работе с исходным кодом на различных языках
программирования.
</p>

<p>
Берем тарбол с официального репозитория
<a href="http://cedet.cvs.sourceforge.net/viewvc/cedet/">http://cedet.cvs.sourceforge.net/viewvc/cedet/</a> и распаковываем его в
~/.emacs.d/cedet
</p>
</div>
</heading>

<heading id="outline-container-unnumbered-2" class="outline-2">
<h2 id="unnumbered-2">Компиляция в Emacs-e</h2>
<div class="outline-text-2" id="text-unnumbered-2">
<p>
После этого заходим туда и отдаем команду
&lt;pre&gt;
$ emacs -Q -l cedet-build.el -f cedet-build
&lt;/pre&gt;
Таким нетривиальным образом, через emacs, оказывается можно собрать и
скомпилить cedet.
</p>
</div>
</heading>

<heading id="outline-container-unnumbered-3" class="outline-2">
<h2 id="unnumbered-3">Настройка</h2>
<div class="outline-text-2" id="text-unnumbered-3">
<p>
После завершения компиляции добавляем в init.el
следующие строки:
&lt;source lang="lisp"&gt;
;; Load CEDET.
;; See cedet/common/cedet.info for configuration details.
(load-file "~/.emacs.d/cedet/common/cedet.el")
</p>

<p>
;; Enable EDE (Project Management) features
(global-ede-mode 1)
</p>

<p>
;; Enable EDE for a pre-existing C++ project
;; (ede-cpp-root-project "NAME" :file "~/myproject/Makefile")
</p>

<p>
;; Enabling Semantic (code-parsing, smart completion) features
;; Select one of the following:
</p>

<p>
;; * This enables the database and idle reparse engines
(semantic-load-enable-minimum-features)
</p>

<p>
;; * This enables some tools useful for coding, such as summary mode
;;   imenu support, and the semantic navigator
(semantic-load-enable-code-helpers)
</p>

<p>
;; * This enables even more coding tools such as intellisense mode
;;   decoration mode, and stickyfunc mode (plus regular code helpers)
;; (semantic-load-enable-gaudy-code-helpers)
</p>

<p>
;; * This enables the use of Exuberent ctags if you have it installed.
;;   If you use C++ templates or boost, you should NOT enable it.
;; (semantic-load-enable-all-exuberent-ctags-support)
;;   Or, use one of these two types of support.
;;   Add support for new languges only via ctags.
;; (semantic-load-enable-primary-exuberent-ctags-support)
;;   Add support for using ctags as a backup parser.
;; (semantic-load-enable-secondary-exuberent-ctags-support)
</p>

<p>
;; Enable SRecode (Template management) minor-mode.
;; (global-srecode-minor-mode 1)
</p>

<p>
;; from yakor<sub>spb</sub>@emacs.conference.jabber.ru
(semantic-load-enable-excessive-code-helpers)
</p>

<p>
;; Code Folding ; <a href="http://alexott-ru.blogspot.com/2009/01/blog-post.html">http://alexott-ru.blogspot.com/2009/01/blog-post.html</a>
(defun my-semantic-hook ()
  (semantic-tag-folding-mode 1))
(add-hook 'semantic-init-hooks 'my-semantic-hook)
&lt;/source&gt;
</p>

<p>
Теперь можно получить настоящее удовольствие при программировании!
</p>
</div>
</heading>
